namespace AuthSystem.Domain.Enums;

/// <summary>
/// انواع دستگاه‌هایی که کاربران می‌توانند از آن‌ها وارد سیستم شوند
/// این enum برای مدیریت انواع دستگاه‌ها در سیستم احراز هویت استفاده می‌شود
/// </summary>
/// 
[Flags]
public enum DeviceType
{
    /// <summary>
    /// نوع دستگاه نامشخص است
    /// این مقدار زمانی استفاده می‌شود که سیستم نتواند نوع دستگاه را تشخیص دهد
    /// </summary>
    Unknown = 0,

    /// <summary>
    /// دستگاه رایانه شخصی یا لپ‌تاپ
    /// این مقدار برای دستگاه‌های دسکتاپ و لپ‌تاپ استفاده می‌شود
    /// </summary>
    Desktop = 1,

    /// <summary>
    /// دستگاه گوشی همراه
    /// این مقدار برای تلفن‌های همراه استفاده می‌شود
    /// </summary>
    Mobile = 2,

    /// <summary>
    /// دستگاه تبلت
    /// این مقدار برای تبلت‌ها استفاده می‌شود
    /// </summary>
    Tablet = 4
}